In [2]:
import pandas as pd

In [ ]:
df_tack= pd.read_csv(r'F:\Arslonbek\\MySecondBrain\DataAnalitika\Python_homework\lesson-18\homework\tackoverflow_qa.csv')
df_tack.head(2)

In [45]:
df_tic= pd.read_csv(r'F:\Arslonbek\MySecondBrain\DataAnalitika\Python_homework\lesson-18\homework\titanic.csv')
df_tic.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

1.Find all questions that were created before 2014

In [75]:
df_tack['creationdate'] = pd.to_datetime(df_tack['creationdate'])

In [76]:
filtered = df_tack[df_tack['creationdate'].dt.year <2014]
filtered = df_tack[['creationdate', 'title']]
print(filtered)

            creationdate                                              title
0    2008-12-01 21:24:44  How do I change the size of figures drawn with...
1    2010-01-12 19:31:47                      How to invert the x or y axis
2    2010-02-09 00:51:38               How can I create stacked line graph?
3    2011-03-30 12:26:50                           Rolling median in python
4    2011-04-01 14:50:44       Compute a compounded return series in Python
...                  ...                                                ...
9458 2014-12-23 20:15:38     drop_duplicates() in Pandas Based on Condition
9459 2014-12-29 17:13:03  Replace a whole dataframe with another (overwr...
9460 2014-12-28 02:53:36  Extract indices of cells meeting criteria from...
9461 2014-12-30 21:01:45  Pandas DataFrame Assignment Issue - Possible Bug?
9462 2014-12-30 20:59:58        Python- Pandas - date time index type error

[9463 rows x 2 columns]

2.Find all questions with a score more than 50

In [77]:
# df_tack[['score', 'title']]
filtered_score = df_tack[df_tack['score']>5][['score', 'title']]
print(filtered_score)

      score                                              title
0      3184  How do I change the size of figures drawn with...
1       420                      How to invert the x or y axis
2        51               How can I create stacked line graph?
3         7                           Rolling median in python
4        10       Compute a compounded return series in Python
...     ...                                                ...
9388     43  Replicating rows in a pandas data frame by a c...
9401     28  Intersection of two pandas dataframes based on...
9406      6  Pandas: get second character of the string, fr...
9414    360  why should I make a copy of a data frame in pa...
9427     15  sql select group by a having count(1) > 1 equi...

[2604 rows x 2 columns]

3.Find all questions with a score between 50 and 100

In [78]:
df_tack.head(1)

,id,creationdate,score,viewcount,title,answercount,commentcount,favoritecount,quest_name,quest_rep,ans_name,ans_rep
0,332289,2008-12-01 21:24:44,3184,5962784,How do I change the size of figures drawn with...,14,1,0.0,tatwright,37837.0,NaN,NaN

In [79]:
min_score = df_tack[df_tack['score']>5]
max_score = df_tack[df_tack['score']<50]
filtered = df_tack[(df_tack['score']>5) & (df_tack['score']<50)][['score', 'title']] 
filtered

      score                                              title
3         7                           Rolling median in python
4        10       Compute a compounded return series in Python
6        16  How to get the correlation between two timeser...
8        12  Using pandas, how do I subsample a large DataF...
10       28                  append two data frame with pandas
...     ...                                                ...
9385     15  Selecting local minima and maxima from pandas....
9388     43  Replicating rows in a pandas data frame by a c...
9401     28  Intersection of two pandas dataframes based on...
9406      6  Pandas: get second character of the string, fr...
9427     15  sql select group by a having count(1) > 1 equi...

[1891 rows x 2 columns]

4. Find all questions answered by Scott Boston

In [80]:
filtered_name = df_tack[df_tack['ans_name'] == 'Scott Boston'][['title','ans_name']]
print(filtered_name.count())

title       1
ans_name    1
dtype: int64

5. Find all questions answered by the following 5 users

In [81]:
filtered_answer_count = df_tack[df_tack['answercount'] == 5][['ans_name', 'answercount']]
filtered_answer_count

             ans_name  answercount
3     Mike Pennington            5
117            lbolla            5
132          BrenBarn            5
234               NaN            5
250          BrenBarn            5
...               ...          ...
9084              WGS            5
9163           chrisb            5
9223           EdChum            5
9264              NaN            5
9359       Alex Riley            5

[173 rows x 2 columns]

6. Find all questions that were created between March, 2014 and October 2014 that were answered by Unutbu and have score less than 5.

In [106]:
df_tack.head(1)

,id,creationdate,score,viewcount,title,answercount,commentcount,favoritecount,quest_name,quest_rep,ans_name,ans_rep
0,332289,2008-12-01 21:24:44,3184,5962784,How do I change the size of figures drawn with...,14,1,0.0,tatwright,37837.0,NaN,NaN

In [83]:
df_tack['creationdate'] = pd.to_datetime(df_tack['creationdate'])

filtered_date = df_tack[
    df_tack['creationdate'].between('2014-01-03', '2014-10-31') &
    (df_tack['ans_name'] == 'Ubuntu') &
    (df_tack['score']<5)
]
filtered_date[['creationdate','title', 'score']]

Empty DataFrame
Columns: [creationdate, title, score]
Index: []

7. Find all questions that have score between 5 and 10 or have a view count of greater than 10,000

In [84]:
filtered_data = df_tack[
    (df_tack['score']>5) & 
    (df_tack['score']) &
    (df_tack['viewcount']>10_000)
]
filtered_data = filtered_data[['title', 'score', 'viewcount']]
filtered_data
# df_tack

                                                  title  score  viewcount
2                  How can I create stacked line graph?     51      59922
11    Convert array of string (category) to array of...     11      29155
12    What is the most efficient way to loop through...    401     658113
21    Why were pandas merges in python faster than d...    167      21091
30                    Simple cross-tabulation in pandas     25      18630
...                                                 ...    ...        ...
9371               Pandas: Location of a row with error     23      19138
9381         How to convert matrix to pandas data frame     13     110890
9385  Selecting local minima and maxima from pandas....     15      11332
9388  Replicating rows in a pandas data frame by a c...     43      18504
9427  sql select group by a having count(1) > 1 equi...     15      17818

[947 rows x 3 columns]

8. Find all questions that are not answered by Scott Boston

In [85]:
filtered = df_tack['ans_name'] != 'Scott Boston' # Scott Bostonga teng emaslar 
filtered_data = df_tack[filtered][['ans_name', 'title']]
filtered_data

             ans_name                                              title
0                 NaN  How do I change the size of figures drawn with...
1             Demitri                      How to invert the x or y axis
2                doug               How can I create stacked line graph?
3     Mike Pennington                           Rolling median in python
4     Mike Pennington       Compute a compounded return series in Python
...               ...                                                ...
9458           unutbu     drop_duplicates() in Pandas Based on Condition
9459          Jubbles  Replace a whole dataframe with another (overwr...
9460              DSM  Extract indices of cells meeting criteria from...
9461              Jim  Pandas DataFrame Assignment Issue - Possible Bug?
9462              NaN        Python- Pandas - date time index type error

[9462 rows x 2 columns]

HOMEWORK 3

1. Select Female Passengers in Class 1 with Ages between 20 and 30: Extract a DataFrame containing female passengers in Class 1 with ages between 20 and 30.

In [31]:
df_tic.head(1)

    PassengerId                            Name   Fare        Cabin
27           28  Fortune, Mr. Charles Alexander  263.0  C23 C25 C27

In [92]:
# df_tic.head(1)
filtered = df_tic[
    (df_tic['Sex'] == 'Female') &
    (df_tic['Pclass'] == 1)& 
    (df_tic['Age'].between(20 , 30))
]
filtered_data = filtered[['Sex', 'Pclass', 'Age']]
filtered_data

Empty DataFrame
Columns: [Sex, Pclass, Age]
Index: []

2. Filter Passengers Who Paid More than $100: Create a DataFrame with passengers who paid a fare greater than $100.

In [102]:
# filtered = df_tic['Fare']>100
# df_tic = df_tic[filtered][['Name','Fare', 'Sex', 'Pclass']]
# df_tic

3. Select Passengers Who Survived and Were Alone: Filter passengers who survived and were traveling alone (no siblings, spouses, parents, or children).

In [ ]:
filtered = (df_tic['Survived'] == 1) & (df_tic['SibSp'] == 0) & (df_tic['Parch'] == 0)
df_filtered = df_tic[filtered]
df_filtered

4.  Filter Passengers Embarked from 'C' and Paid More Than $50: Create a DataFrame with passengers who embarked from 'C' and paid more than $50.

In [ ]:
df_filtered = df_tic[(df_tic["Embarked"] =="C" ) & (df_tic["Fare"]>50)][["Name", "Sex", "Embarked","Fare"]]
df_filtered

5. Select Passengers with Siblings or Spouses and Parents or Children: Extract passengers who had both siblings or spouses aboard and parents or children aboard.

In [9]:
df_tic.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [ ]:
filtered = df_tic[
    ((df_tic["SibSp"] == 1) | (df_tic["SibSp"]== 0)) &
    ((df_tic["Parch"] == 1) | (df_tic["Parch"] == 0))
]
df_filtered = filtered[["PassengerId", "Name", "SibSp", "Parch"]]
df_filtered

7. Filter Passengers Aged 15 or Younger Who Didn't Survive: Create a DataFrame with passengers aged 15 or younger who did not survive.

In [29]:
df_tic.head(1)

    PassengerId                            Name   Fare        Cabin
27           28  Fortune, Mr. Charles Alexander  263.0  C23 C25 C27

In [ ]:
filtered = df_tic[(df_tic["Age"] <= 15) & (df_tic["Survived"] == 0)]


df_filtered = filtered[["PassengerId", "Survived", "Age"]]
df_filtered

8. Select Passengers with Cabins and Fare Greater Than $200: Extract passengers with known cabin numbers and a fare greater than $200.

In [ ]:
df_tic.head(10)

In [ ]:
filtered = df_tic[
    (df_tic["Cabin"].notna()) &
      (df_tic['Fare'] >= 200)
]
df_tic = filtered[["PassengerId","Name", "Fare", "Cabin"]]
df_tic

8. Filter Passengers with Odd-Numbered Passenger IDs: Create a DataFrame with passengers whose PassengerId is an odd number.

In [ ]:
df_tic.head()
filtered = df_tic[df_tic["PassengerId"] % 2 !=0]

df_filtered = filtered[['PassengerId', 'Name', 'Age']]
df_filtered

9. Select Passengers with Unique Ticket Numbers: Extract a DataFrame with passengers having unique ticket numbers.

In [46]:
df_tic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
filtered = df_tic["Ticket"].unique()
df_filtered = df_tic[df_tic["Ticket"].isin(filtered)][['Name', 'Ticket']]
df_filtered

10.Filter Passengers with 'Miss' in Their Name and Were in Class 1: Create a DataFrame with female passengers having 'Miss' in their name and were in Class 1.

In [50]:
filtered = df_tic[(df_tic["Pclass"] ==1) & (df_tic["Name"].str.contains("Miss", case = False, na = False))]
df_tic = filtered[["Name", "Pclass"]]
df_tic

Empty DataFrame
Columns: [Name, Pclass]
Index: []